README.md

# Table of Contents

1.  [Dealing polygons](#org1ce8fd8)
    1.  [Quickstart](#orgacbb1da)
    2.  [How to use](#orgc9f1492)



<a id="org1ce8fd8"></a>

# Dealing polygons


<a id="orgacbb1da"></a>

## Quickstart

Clone the repository  

    git clone https://github.com/jeanbtrd/labinftel-esercitazione.git

Compile it  

    g++ *.cpp -o labinftel-esercitazione

Run it  

    ./labinftel-esercitazione


<a id="orgc9f1492"></a>

## How to use

Upon running the executable, you will be prompted for an action.  

1.  Rectangle  
    Press `1` to create a rectangle.  
    You will then be prompted for its parameters:  
    -   Width
    -   Length
2.  Rhombus  
    Press `2` to create a rhombus.  
    You will then be prompted for its parameters:  
    -   Horizontal diagonal
    -   Vertical diagonal
3.  RightTriangle  
    Press `3` to create a rhombus.  
    You will then be prompted for its parameters:  
    -   Base
    -   Altitude
4.  Draw  
    Press `4` to draw the currently existing polygons.  
    Example output:  
    
        Rectangle -- Draw
        Lenght:		14.2
        Width:		12.3
        Area:		174.66
        Perimeter:	53
5.  Exit  
    Press `5` to end the program.

